const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
*╭┈─「*🪀*⧫𝐒ᮀ𝐇ᮀ𝐀ᮀ𝐇ᮀ𝐈ᮀ𝐍ᮁ_ღ꙰𝐁ᮀ𝐎ᮀ𝐓ᮁ🪀**┈┈❍*
*├◈* 💎${settings.botName || ' 𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚'}*  
*├◈* 💎*~_𝐕𝐞𝐫𝐬𝐢𝐨𝐧_~*: *${settings.version || '3.0.0'}*
*├◈* 💎 *~_𝐁𝐘_~* ${settings.botOwner || 'Mr Shahin Rana'}
*├◈* 💎 *~_𝐘𝐓_~* : *~_ 𝐗𝐭𝐲𝐥𝐢𝐬𝐡_ღ꙰𝐒𝐡𝐚𝐡𝐢𝐧࿐_~*
*╰─➤*🪀*⎯⃝‎‎‎*𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚♡➪*

 ❒ 𝐀𝐯𝐚𝐢𝐥𝐚𝐛𝐥𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:*♡︎*

╭────❒ 𝐆𝐞𝐧𝐞𝐫𝐚𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*   🇭‌𝚎𝚕𝚙 𝚘𝚛.𝚖𝚎𝚗𝚞
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌𝚒𝚗𝚐
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌𝚕𝚒𝚟𝚎
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌𝚝𝚜 <𝚝𝚎𝚡𝚝>
├◈  *⎯⃝🩷➪‎‎‎*  .🇴‌𝚠𝚗𝚎𝚛
├◈  *⎯⃝🩷➪‎‎‎*  .🇯‌𝚘𝚔𝚎
├◈  *⎯⃝🩷➪‎‎‎*  .🇶‌𝚞𝚘𝚝𝚎
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌𝚊𝚌𝚝
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌𝚎𝚊𝚝𝚑𝚎𝚛 <𝚌𝚒𝚝𝚢>
├◈  *⎯⃝🩷➪‎‎‎*  .🇳‌𝚎𝚠𝚜
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌𝚝𝚝𝚙 <𝚝𝚎𝚡𝚝>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌𝚢𝚛𝚒𝚌𝚜 <𝚜𝚘𝚗𝚐_𝚝𝚒𝚝𝚕𝚎>
├◈  *⎯⃝🩷➪‎‎‎* .8🇧‌𝚊𝚕𝚕 <𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌𝚛𝚘𝚞𝚙𝚒𝚗𝚏𝚘
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌𝚝𝚊𝚏𝚏 𝚘𝚛 .𝚊𝚍𝚖𝚒𝚗𝚜 
├◈  *⎯⃝🩷➪‎‎‎*  .🇻‌𝚟
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌𝚛𝚝 <𝚝𝚎𝚡𝚝> <𝚕𝚊𝚗𝚐>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌𝚜 <𝚕𝚒𝚗𝚔>
├◈  *⎯⃝🩷➪‎‎‎*  .🇯‌𝚒𝚍
├◈  *⎯⃝🩷➪‎‎‎*  .🇺‌𝚛𝚕
┕──────────────────❒

╭────❒ 𝙰𝚍𝚖𝚒𝚗 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌an @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌romote @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌emote @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ute <minutes>
├◈  *⎯⃝🩷➪‎‎‎*  .🇺‌nmute
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌elete or .del
├◈  *⎯⃝🩷➪‎‎‎*  .🇰‌ick @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌arnings @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌arn @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntilink
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntibadword
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌lear
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ag <message>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌agall
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌agnotadmin
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌idetag <message>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌hatbot
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌esetlink
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntitag <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌elcome <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌oodbye <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgdesc <description>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgname <new name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgpp (reply to image)
┕──────────────────❒

╭────❒ 𝐎𝐰𝐧𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ode <public/private>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌learsession
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntidelete
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌leartmp
├◈  *⎯⃝🩷➪‎‎‎*  .🇺‌pdate
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ettings
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etpp <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoreact <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus react <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utotyping <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoread <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nticall <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker <on/off/status>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker setmsg <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etmention <reply to msg>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ention <on/off>
┕──────────────────❒

╭────❒ 𝐈𝐦𝐚𝐠𝐞 /𝐒𝐭𝐢𝐜𝐤𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lur <image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌image <reply to sticker>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ticker <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emovebg
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emini
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌rop <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌gsticker <Link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌eme
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ake <packname> 
├◈  *⎯⃝🩷➪‎‎‎*  .🇪‌mojimix <emj1>+<emj2>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gs <insta link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gsc <insta link>
┕──────────────────❒ 

╭────❒ 𝐏𝐢𝐞𝐬 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌ies <country>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌hina 
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ndonesia 
├◈  *⎯⃝🩷➪‎‎‎*  .🇯‌apan 
├◈  *⎯⃝🩷➪‎‎‎*  .🇰‌orea 
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌ijab
┕──────────────────❒

╭────❒ 𝐆𝐚𝐦𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ictactoe @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌angman
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌uess <letter>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌rivia
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nswer <answer>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ruth
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌are
┕──────────────────❒

╭────❒ 𝐀𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌pt <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌emini <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇮‌magine <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇫‌lux <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌ora <prompt>
┕──────────────────❒

╭────❒ 𝐅𝐮𝐧 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌ompliment @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌nsult @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌lirt 
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hayari
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌oodnight
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌oseday
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌haracter @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌asted @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hip @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌imp @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌tupid @user [text]
┕──────────────────❒

╭────❒ 𝐓𝐞𝐱𝐭𝐦𝐚𝐤𝐞𝐫:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌etallic <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ce <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌now <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌mpressive <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌atrix <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌ight <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇳‌eon <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌evil <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌urple <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌hunder <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌eaves <text>
├◈  *⎯⃝🩷➪‎‎‎*  .1917 <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌rena <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌acker <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lackpink <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌litch <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌ire <text>
┕──────────────────❒

╭────❒ 𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌lay <song_name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ong <song_name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌potify <query>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌nstagram <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌acebook <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌iktok <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇻‌ideo <song name>
├◈  *⎯⃝🩷➪‎‎‎*  . <Link>
┕──────────────────❒

╭────❒ 𝐌𝐢𝐬𝐜:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌eart
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌orny
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌ircle
├◈  *⎯⃝🩷➪‎‎‎* .🇱‌gbt
├◈  *⎯⃝🩷➪‎‎‎* .🇱‌olice
├◈  *⎯⃝🩷➪‎‎‎* .🇮‌ts-so-stupid
├◈  *⎯⃝🩷➪‎‎‎* .🇳‌amecard 
├◈  *⎯⃝🩷➪‎‎‎* .🇴‌ogway
├◈  *⎯⃝🩷➪‎‎‎* .🇹‌weet
├◈  *⎯⃝🩷➪‎‎‎* .🇾‌tcomment 
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌omrade 
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌ay 
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌lass 
├◈  *⎯⃝🩷➪‎‎‎* .🇯‌ail 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌assed 
├◈  *⎯⃝🩷➪‎‎‎* .🇹‌riggered
┕──────────────────❒

╭────❒ 𝐀𝐧𝐢𝐦𝐞:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇳‌om 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌oke 
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌ry 
├◈  *⎯⃝🩷➪‎‎‎* .🇰‌iss 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌at 
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌ug 
├◈  *⎯⃝🩷➪‎‎‎* .🇼‌ink 
├◈  *⎯⃝🩷➪‎‎‎* .🇫‌acepalm 
┕──────────────────❒

╭────❒ 𝐆𝐢𝐭𝐡𝐮𝐛 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌it
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌ithub
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌c
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌cript
├◈  *⎯⃝🩷➪‎‎‎* .🇷‌epo
┕──────────────────❒





💖 *~_Made with love by Shahin -Rana_~*:`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'SHAHIN RANA',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'Shahin bot by Mr Shahin Rana',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;
