const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
*╭┈─「*🪀*⧫𝐒ᮀ𝐇ᮀ𝐀ᮀ𝐇ᮀ𝐈ᮀ𝐍ᮁ_ღ꙰𝐁ᮀ𝐎ᮀ𝐓ᮁ🪀**┈❍*
*├◈* 💎${settings.botName || ' 𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚'}*  
*├◈* 💎*~_𝐕𝐞𝐫𝐬𝐢𝐨𝐧_~*: *${settings.version || '3.0.0'}*
*├◈* 💎 *~_𝐁𝐘_~* ${settings.botOwner || 'Mr Shahin Rana'}
*├◈* 💎 *~_𝐘𝐓_~* : *~_ 𝐗𝐭𝐲𝐥𝐢𝐬𝐡_ღ꙰𝐒𝐡𝐚𝐡𝐢𝐧࿐_~*
*╰─➤*💗*⎯⃝‎‎‎*𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚♡➪*

 ❒ 𝓐𝓿𝓪𝓲𝓵𝓪𝓫𝓵𝓮 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:*♡︎*

╭────❒ 𝓖𝓮𝓷𝓮𝓻𝓪𝓵 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:❒
├◈  *⎯⃝🩷➪‎‎‎*   𝓱𝓮𝓵𝓹 𝓸𝓻. 𝓶𝓮𝓷𝓾
├◈  *⎯⃝🩷➪‎‎‎*  .𝓹𝓲𝓷𝓰
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓵𝓲𝓿𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓽𝓼 <𝓽𝓮𝔁𝓽>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓞𝔀𝓷𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓙𝓸𝓴𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓠𝓾𝓸𝓽𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓕𝓪𝓬𝓽
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓱𝓮𝓪𝓽𝓱𝓮𝓻 <𝓬𝓲𝓽𝔂>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓝𝓮𝔀𝓼
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓽𝓽𝓹 <𝓽𝓮𝔁𝓽>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓛𝔂𝓻𝓲𝓬𝓼 <𝓢𝓸𝓷𝓰_𝓽𝓲𝓽𝓵𝓮>
├◈  *⎯⃝🩷➪‎‎‎* .8𝓑𝓪𝓵𝓵 <𝓺𝓾𝓮𝓼𝓽𝓲𝓸𝓷>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓖𝓻𝓸𝓾𝓹𝓲𝓷𝓯𝓸
├◈  *⎯⃝🩷➪‎‎‎*  .𝓢𝓽𝓪𝓯𝓯 𝓸𝓻 .𝓪𝓭𝓶𝓲𝓷𝓼 
├◈  *⎯⃝🩷➪‎‎‎*  .𝓿𝓿
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓻𝓽 <𝓽𝓮𝔁𝓽> <𝓵𝓪𝓷𝓰>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓢𝓼 <𝓵𝓲𝓷𝓴>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓙𝓲𝓭
├◈  *⎯⃝🩷➪‎‎‎*  .𝓤𝓻𝓵
┕──────────────────❒

╭────❒ 𝓐𝓭𝓶𝓲𝓷 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:❒
├◈  *⎯⃝🩷➪‎‎‎*  .𝓑𝓪𝓷 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓹𝓻𝓸𝓶𝓸𝓽𝓮 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓓𝓮𝓶𝓸𝓽𝓮 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓶𝓾𝓽𝓮 <𝓶𝓲𝓷𝓾𝓽𝓮𝓼>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓾𝓷𝓶𝓾𝓽𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓓𝓮𝓵𝓮𝓽𝓮 𝓸𝓻 .𝓭𝓮𝓵
├◈  *⎯⃝🩷➪‎‎‎*  .𝓴𝓲𝓬𝓴 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓪𝓻𝓷𝓲𝓷𝓰𝓼 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓪𝓻𝓷 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓷𝓽𝓲𝓵𝓲𝓷𝓴
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓷𝓽𝓲𝓫𝓪𝓭𝔀𝓸𝓻𝓭
├◈  *⎯⃝🩷➪‎‎‎*  .𝓬𝓵𝓮𝓪𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰 <𝓶𝓮𝓼𝓼𝓪𝓰𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰𝓪𝓵𝓵
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰𝓷𝓸𝓽𝓐𝓭𝓶𝓲𝓷
├◈  *⎯⃝🩷➪‎‎‎*  .𝓱𝓲𝓭𝓮𝓽𝓪𝓰 <𝓶𝓮𝓼𝓼𝓪𝓰𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓬𝓱𝓪𝓽𝓫𝓸𝓽
├◈  *⎯⃝🩷➪‎‎‎*  .𝓡𝓮𝓼𝓮𝓽 
├◈  *⎯⃝🩷➪‎‎‎*  .𝓪𝓷𝓽𝓲𝓽𝓪𝓰 <𝓸𝓷/𝓸𝓯𝓯>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓮𝓵𝓬𝓸𝓶𝓮 <𝓸𝓷/𝓸𝓯𝓯>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓰𝓸𝓸𝓭𝓫𝔂𝓮 <𝓸𝓷/𝓸𝓯𝓯>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓼𝓮𝓽𝓰𝓭𝓮𝓼𝓬 <𝓭𝓮𝓼𝓬𝓻𝓲𝓹𝓽𝓲𝓸𝓷>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓼𝓮𝓽𝓰𝓷𝓪𝓶𝓮 <𝓝𝓮𝔀 𝓝𝓪𝓶𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓼𝓮𝓽𝓰𝓹𝓹 (𝓻𝓮𝓹𝓵𝔂 𝓽𝓸 𝓲𝓶𝓪𝓰𝓮)
┕──────────────────❒

╭────❒ 𝐎𝐰𝐧𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ode <public/private>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌learsession
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntidelete
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌leartmp
├◈  *⎯⃝🩷➪‎‎‎*  .🇺‌pdate
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ettings
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etpp <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoreact <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus react <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utotyping <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoread <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nticall <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker <on/off/status>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker setmsg <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etmention <reply to msg>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ention <on/off>
┕──────────────────❒

╭────❒ 𝐈𝐦𝐚𝐠𝐞 /𝐒𝐭𝐢𝐜𝐤𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lur <image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌image <reply to sticker>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ticker <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emovebg
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emini
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌rop <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌gsticker <Link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌eme
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ake <packname> 
├◈  *⎯⃝🩷➪‎‎‎*  .🇪‌mojimix <emj1>+<emj2>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gs <insta link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gsc <insta link>
┕──────────────────❒ 

╭────❒ 𝐏𝐢𝐞𝐬 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌ies <country>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌hina 
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ndonesia 
├◈  *⎯⃝🩷➪‎‎‎*  .🇯‌apan 
├◈  *⎯⃝🩷➪‎‎‎*  .🇰‌orea 
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌ijab
┕──────────────────❒

╭────❒ 𝐆𝐚𝐦𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ictactoe @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌angman
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌uess <letter>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌rivia
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nswer <answer>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ruth
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌are
┕──────────────────❒

╭────❒ 𝐀𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌pt <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌emini <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇮‌magine <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇫‌lux <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌ora <prompt>
┕──────────────────❒

╭────❒ 𝐅𝐮𝐧 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌ompliment @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌nsult @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌lirt 
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hayari
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌oodnight
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌oseday
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌haracter @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌asted @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hip @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌imp @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌tupid @user [text]
┕──────────────────❒

╭────❒ 𝐓𝐞𝐱𝐭𝐦𝐚𝐤𝐞𝐫:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌etallic <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ce <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌now <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌mpressive <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌atrix <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌ight <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇳‌eon <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌evil <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌urple <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌hunder <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌eaves <text>
├◈  *⎯⃝🩷➪‎‎‎*  .1917 <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌rena <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌acker <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lackpink <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌litch <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌ire <text>
┕──────────────────❒

╭────❒ 𝓓𝓸𝔀𝓷𝓵𝓸𝓭𝓮𝓻:❒
├◈  *⎯⃝🩷➪‎‎‎*  .𝓹𝓵𝓪𝔂 <𝓼𝓸𝓷𝓰_𝓷𝓪𝓶𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓼𝓸𝓷𝓰 <𝓼𝓸𝓷𝓰_𝓷𝓪𝓶𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓼𝓹𝓸𝓽𝓲𝓯𝔂 <𝓺𝓾𝓮𝓻𝔂>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓲𝓷𝓼𝓽𝓪𝓰𝓻𝓪𝓶 <𝓵𝓲𝓷𝓴>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓯𝓪𝓬𝓮𝓫𝓸𝓸𝓴 <𝓵𝓲𝓷𝓴>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓽𝓲𝓴𝓽𝓸𝓴 <𝓵𝓲𝓷𝓴>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓿𝓲𝓭𝓮𝓸 <𝓼𝓸𝓷𝓰 𝓷𝓪𝓶𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  . <𝓵𝓲𝓷𝓴>
┕──────────────────❒

╭────❒ 𝓜𝓲𝓼𝓬:❒
├◈  *⎯⃝🩷➪‎‎‎* .𝓗𝓮𝓪𝓻𝓽
├◈  *⎯⃝🩷➪‎‎‎* .𝓱𝓸𝓻𝓷𝓮𝔂
├◈  *⎯⃝🩷➪‎‎‎* .𝓬𝓲𝓻𝓬𝓵𝓮
├◈  *⎯⃝🩷➪‎‎‎* .𝓛𝓰𝓫𝓽
├◈  *⎯⃝🩷➪‎‎‎* .𝓛𝓸𝓵𝓲𝓬𝓮
├◈  *⎯⃝🩷➪‎‎‎* .𝓵𝓽𝓼-𝓼𝓸-𝓼𝓽𝓾𝓹𝓲𝓭
├◈  *⎯⃝🩷➪‎‎‎* .𝓷𝓪𝓶𝓮𝓬𝓪𝓻𝓭 
├◈  *⎯⃝🩷➪‎‎‎* .𝓸𝓸𝓰𝔀𝓪𝔂
├◈  *⎯⃝🩷➪‎‎‎* .𝓽𝔀𝓮𝓮𝓽
├◈  *⎯⃝🩷➪‎‎‎* .𝔂𝓽𝓬𝓸𝓶𝓶𝓮𝓷𝓽 
├◈  *⎯⃝🩷➪‎‎‎* .𝓬𝓸𝓶𝓻𝓪𝓭𝓮 
├◈  *⎯⃝🩷➪‎‎‎* .𝓰𝓪𝔂 
├◈  *⎯⃝🩷➪‎‎‎* .𝓰𝓵𝓪𝓼𝓼 
├◈  *⎯⃝🩷➪‎‎‎* .𝓳𝓪𝓲𝓵 
├◈  *⎯⃝🩷➪‎‎‎* .𝓹𝓪𝓼𝓼𝓮𝓭 
├◈  *⎯⃝🩷➪‎‎‎* .𝓽𝓻𝓲𝓰𝓰𝓮𝓻𝓮𝓭
┕──────────────────❒

╭────❒ 𝓐𝓷𝓲𝓶𝓮:❒
├◈  *⎯⃝🩷➪‎‎‎* .𝓷𝓸𝓶 
├◈  *⎯⃝🩷➪‎‎‎* .𝓹𝓸𝓴𝓮 
├◈  *⎯⃝🩷➪‎‎‎* .𝓬𝓻𝔂 
├◈  *⎯⃝🩷➪‎‎‎* .𝓴𝓲𝓼𝓼 
├◈  *⎯⃝🩷➪‎‎‎* .𝓹𝓪𝓽 
├◈  *⎯⃝🩷➪‎‎‎* .𝓱𝓾𝓰 
├◈  *⎯⃝🩷➪‎‎‎* .𝔀𝓲𝓷𝓴 
├◈  *⎯⃝🩷➪‎‎‎* .𝓯𝓪𝓬𝓮𝓹𝓪𝓵𝓶 
┕──────────────────❒

╭────❒ 𝓖𝓲𝓽𝓱𝓾𝓫 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:❒
├◈  *⎯⃝🩷➪‎‎‎* .𝓰𝓲𝓽
├◈  *⎯⃝🩷➪‎‎‎* .𝓖𝓲𝓽𝓱𝓾𝓫
├◈  *⎯⃝🩷➪‎‎‎* .𝓼𝓬
├◈  *⎯⃝🩷➪‎‎‎* .𝓼𝓬𝓻𝓲𝓹𝓽
├◈  *⎯⃝🩷➪‎‎‎* .𝓡𝓮𝓹𝓸
┕──────────────────❒





💖 *~_Made with love by Shahin -Rana_~*:`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'SHAHIN RANA',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'Shahin bot by Mr Shahin Rana',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;
