const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
*╭┈─「*🪀*⧫𝐒ᮀ𝐇ᮀ𝐀ᮀ𝐇ᮀ𝐈ᮀ𝐍ᮁ_ღ꙰𝐁ᮀ𝐎ᮀ𝐓ᮁ🪀**┈┈❍*
*├◈* 💎${settings.botName || ' 𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚'}*  
*├◈* 💎*~_𝐕𝐞𝐫𝐬𝐢𝐨𝐧_~*: *${settings.version || '3.0.0'}*
*├◈* 💎 *~_𝐁𝐘_~* ${settings.botOwner || 'Mr Shahin Rana'}
*├◈* 💎 *~_𝐘𝐓_~* : *~_ 𝐗𝐭𝐲𝐥𝐢𝐬𝐡_ღ꙰𝐒𝐡𝐚𝐡𝐢𝐧࿐_~*
*╰─➤*💗*⎯⃝‎‎‎*𝐒𝐡𝐚𝐡𝐢𝐧 𝐑𝐚𝐧𝐚♡➪*

 ❒ 𝓐𝓿𝓪𝓲𝓵𝓪𝓫𝓵𝓮 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:*♡︎*

╭────❒ 𝓖𝓮𝓷𝓮𝓻𝓪𝓵 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:❒
├◈  *⎯⃝🩷➪‎‎‎*   𝓱𝓮𝓵𝓹 𝓸𝓻. 𝓶𝓮𝓷𝓾
├◈  *⎯⃝🩷➪‎‎‎*  .𝓹𝓲𝓷𝓰
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓵𝓲𝓿𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓽𝓼 <𝓽𝓮𝔁𝓽>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓞𝔀𝓷𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓙𝓸𝓴𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓠𝓾𝓸𝓽𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓕𝓪𝓬𝓽
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓱𝓮𝓪𝓽𝓱𝓮𝓻 <𝓬𝓲𝓽𝔂>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓝𝓮𝔀𝓼
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓽𝓽𝓹 <𝓽𝓮𝔁𝓽>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓛𝔂𝓻𝓲𝓬𝓼 <𝓢𝓸𝓷𝓰_𝓽𝓲𝓽𝓵𝓮>
├◈  *⎯⃝🩷➪‎‎‎* .8𝓑𝓪𝓵𝓵 <𝓺𝓾𝓮𝓼𝓽𝓲𝓸𝓷>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓖𝓻𝓸𝓾𝓹𝓲𝓷𝓯𝓸
├◈  *⎯⃝🩷➪‎‎‎*  .𝓢𝓽𝓪𝓯𝓯 𝓸𝓻 .𝓪𝓭𝓶𝓲𝓷𝓼 
├◈  *⎯⃝🩷➪‎‎‎*  .𝓿𝓿
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓻𝓽 <𝓽𝓮𝔁𝓽> <𝓵𝓪𝓷𝓰>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓢𝓼 <𝓵𝓲𝓷𝓴>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓙𝓲𝓭
├◈  *⎯⃝🩷➪‎‎‎*  .𝓤𝓻𝓵
┕──────────────────❒

╭────❒ 𝓐𝓭𝓶𝓲𝓷 𝓬𝓸𝓶𝓶𝓪𝓷𝓭𝓼:❒
├◈  *⎯⃝🩷➪‎‎‎*  .𝓑𝓪𝓷 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓹𝓻𝓸𝓶𝓸𝓽𝓮 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓓𝓮𝓶𝓸𝓽𝓮 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓶𝓾𝓽𝓮 <𝓶𝓲𝓷𝓾𝓽𝓮𝓼>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓾𝓷𝓶𝓾𝓽𝓮
├◈  *⎯⃝🩷➪‎‎‎*  .𝓓𝓮𝓵𝓮𝓽𝓮 𝓸𝓻 .𝓭𝓮𝓵
├◈  *⎯⃝🩷➪‎‎‎*  .𝓴𝓲𝓬𝓴 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓪𝓻𝓷𝓲𝓷𝓰𝓼 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓦𝓪𝓻𝓷 @𝓾𝓼𝓮𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓷𝓽𝓲𝓵𝓲𝓷𝓴
├◈  *⎯⃝🩷➪‎‎‎*  .𝓐𝓷𝓽𝓲𝓫𝓪𝓭𝔀𝓸𝓻𝓭
├◈  *⎯⃝🩷➪‎‎‎*  .𝓬𝓵𝓮𝓪𝓻
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰 <𝓶𝓮𝓼𝓼𝓪𝓰𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰𝓪𝓵𝓵
├◈  *⎯⃝🩷➪‎‎‎*  .𝓣𝓪𝓰𝓷𝓸𝓽𝓐𝓭𝓶𝓲𝓷
├◈  *⎯⃝🩷➪‎‎‎*  .𝓱𝓲𝓭𝓮𝓽𝓪𝓰 <𝓶𝓮𝓼𝓼𝓪𝓰𝓮>
├◈  *⎯⃝🩷➪‎‎‎*  .𝓬𝓱𝓪𝓽𝓫𝓸𝓽
├◈  *⎯⃝🩷➪‎‎‎*  .𝓡𝓮𝓼𝓮𝓽 
├◈  *⎯⃝🩷➪‎‎‎*  .𝓪𝓷𝓽𝓲𝓽𝓪𝓰 <𝓸𝓷/𝓸𝓯𝓯>
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌elcome <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌oodbye <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgdesc <description>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgname <new name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etgpp (reply to image)
┕──────────────────❒

╭────❒ 𝐎𝐰𝐧𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ode <public/private>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌learsession
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌ntidelete
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌leartmp
├◈  *⎯⃝🩷➪‎‎‎*  .🇺‌pdate
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ettings
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etpp <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoreact <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utostatus react <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utotyping <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌utoread <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nticall <on/off>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker <on/off/status>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌mblocker setmsg <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌etmention <reply to msg>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌ention <on/off>
┕──────────────────❒

╭────❒ 𝐈𝐦𝐚𝐠𝐞 /𝐒𝐭𝐢𝐜𝐤𝐞𝐫 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lur <image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌image <reply to sticker>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ticker <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emovebg
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌emini
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌rop <reply to image>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌gsticker <Link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌eme
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ake <packname> 
├◈  *⎯⃝🩷➪‎‎‎*  .🇪‌mojimix <emj1>+<emj2>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gs <insta link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌gsc <insta link>
┕──────────────────❒ 

╭────❒ 𝐏𝐢𝐞𝐬 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌ies <country>
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌hina 
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ndonesia 
├◈  *⎯⃝🩷➪‎‎‎*  .🇯‌apan 
├◈  *⎯⃝🩷➪‎‎‎*  .🇰‌orea 
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌ijab
┕──────────────────❒

╭────❒ 𝐆𝐚𝐦𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ictactoe @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌angman
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌uess <letter>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌rivia
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌nswer <answer>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌ruth
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌are
┕──────────────────❒

╭────❒ 𝐀𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌pt <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌emini <question>
├◈  *⎯⃝🩷➪‎‎‎* .🇮‌magine <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇫‌lux <prompt>
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌ora <prompt>
┕──────────────────❒

╭────❒ 𝐅𝐮𝐧 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌ompliment @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌nsult @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌lirt 
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hayari
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌oodnight
├◈  *⎯⃝🩷➪‎‎‎*  .🇷‌oseday
├◈  *⎯⃝🩷➪‎‎‎*  .🇨‌haracter @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇼‌asted @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌hip @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌imp @user
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌tupid @user [text]
┕──────────────────❒

╭────❒ 𝐓𝐞𝐱𝐭𝐦𝐚𝐤𝐞𝐫:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌etallic <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌ce <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌now <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌mpressive <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇲‌atrix <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌ight <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇳‌eon <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇩‌evil <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌urple <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌hunder <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇱‌eaves <text>
├◈  *⎯⃝🩷➪‎‎‎*  .1917 <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇦‌rena <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇭‌acker <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇧‌lackpink <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇬‌litch <text>
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌ire <text>
┕──────────────────❒

╭────❒ 𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫:❒
├◈  *⎯⃝🩷➪‎‎‎*  .🇵‌lay <song_name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌ong <song_name>
├◈  *⎯⃝🩷➪‎‎‎*  .🇸‌potify <query>
├◈  *⎯⃝🩷➪‎‎‎*  .🇮‌nstagram <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇫‌acebook <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇹‌iktok <link>
├◈  *⎯⃝🩷➪‎‎‎*  .🇻‌ideo <song name>
├◈  *⎯⃝🩷➪‎‎‎*  . <Link>
┕──────────────────❒

╭────❒ 𝐌𝐢𝐬𝐜:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌eart
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌orny
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌ircle
├◈  *⎯⃝🩷➪‎‎‎* .🇱‌gbt
├◈  *⎯⃝🩷➪‎‎‎* .🇱‌olice
├◈  *⎯⃝🩷➪‎‎‎* .🇮‌ts-so-stupid
├◈  *⎯⃝🩷➪‎‎‎* .🇳‌amecard 
├◈  *⎯⃝🩷➪‎‎‎* .🇴‌ogway
├◈  *⎯⃝🩷➪‎‎‎* .🇹‌weet
├◈  *⎯⃝🩷➪‎‎‎* .🇾‌tcomment 
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌omrade 
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌ay 
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌lass 
├◈  *⎯⃝🩷➪‎‎‎* .🇯‌ail 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌assed 
├◈  *⎯⃝🩷➪‎‎‎* .🇹‌riggered
┕──────────────────❒

╭────❒ 𝐀𝐧𝐢𝐦𝐞:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇳‌om 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌oke 
├◈  *⎯⃝🩷➪‎‎‎* .🇨‌ry 
├◈  *⎯⃝🩷➪‎‎‎* .🇰‌iss 
├◈  *⎯⃝🩷➪‎‎‎* .🇵‌at 
├◈  *⎯⃝🩷➪‎‎‎* .🇭‌ug 
├◈  *⎯⃝🩷➪‎‎‎* .🇼‌ink 
├◈  *⎯⃝🩷➪‎‎‎* .🇫‌acepalm 
┕──────────────────❒

╭────❒ 𝐆𝐢𝐭𝐡𝐮𝐛 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬:❒
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌it
├◈  *⎯⃝🩷➪‎‎‎* .🇬‌ithub
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌c
├◈  *⎯⃝🩷➪‎‎‎* .🇸‌cript
├◈  *⎯⃝🩷➪‎‎‎* .🇷‌epo
┕──────────────────❒





💖 *~_Made with love by Shahin -Rana_~*:`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'SHAHIN RANA',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'Shahin bot by Mr Shahin Rana',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;
